#ifndef SYMBOLS_H
#define SYMBOLS_H

#include <iostream>
#include <string>
#include <stdio.h>
#include <Windows.h>
#include <algorithm>
#include <fstream>
#include <vector>
using namespace std;

namespace symbols {

	vector <const char*> Alphabet_pCONSTCHAR = {
		"А", "Б", "В", "Г", "Д", "Е", "Ж", "З",
		"И", "Й", "К", "Л", "М", "Н", "О", "П",
		"Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч",
		"Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я",
	};


	vector <char> Alphabet_CHAR = {
		'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З',
		'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П',
		'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч',
		'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я',
	};

	vector  <const char*> eAlphabet_pCONSTCHAR = {
		"A", "B", "C", "D", "E", "F",
		"G", "H", "I", "J", "K", "L",
		"M", "N", "O", "P", "Q", "R",
		"S", "T", "U", "V", "W", "X",
		"Y", "Z"
	};

	vector  <char> eAlphabet_CHAR = {
		'A', 'B', 'C', 'D', 'E', 'F',
		'G', 'H', 'I', 'J', 'K', 'L',
		'M', 'N', 'O', 'P', 'Q', 'R',
		'S', 'T', 'U', 'V', 'W', 'X',
		'Y', 'Z'
	};

	vector <const char*> Punctuation_pCONSTCHAR = {
		".", ",", "?", "'",
		"!", "/", "(", ")",
		 "&", ":", ";", "=",
		 "+", "-", "_", "'",
		 "$", "@", "¿", "¡"
	};

	vector <char> Punctuation_CHAR = {
		'.', ',', '?', "'"[0],
		'!', '/', '(', ')',
		 '&', ':', ';', '=',
		 '+', '-', '_', '"',
		 '$', '@', '¿', '¡'
	};

	vector <char> Numbers_CHAR = {
		'0', '1', '2', '3', '4',
		'5', '6', '7', '8', '9'
	};

	vector <const char*> Numbers_pCONSTCHAR = {
		"0", "1", "2", "3", "4",
		"5", "6", "7", "8", "9"
	};

	vector <const char*> Morze_Alphabet_Rus = {
		// Алфавит idx: 0-31
		// А - З
		".-", "-...", ".--", "--.", "-..", ".", "...-", "--..",
		// И - П
		"..", ".---", "-.-", ".-..", "--", "-.", "---", ".--.",
		// Р - Ч
		".-.", "...", "-", "..-", "..-.", "....", "-.-.", "---.",
		// Ш - Я
		"----", "--.-", "--.--", "-.--", "-..-", "..-..", "..--", ".-.-",
	};

	vector <const char*> Morze_Alphabet_Eng = {
		".-", "-...", "-.-.", "-..", ".", "..-.",
		"--.", "....", "..", ".---", "-.-", ".-..",
		"--", "-.", "---", ".--.", "--.-", ".-.",
		"...", "-", "..-", "...-", ".--", "-..-", 
		"-.--", "--..", "---.", "----", "--.--", 
		"..-..", "..--", ".-.-"
	};

	vector <const char*> Morze_Punctuation = {
		/* . */ ".-.-.-", /* , */ "--..--", /* ? */ "..--..", /* ' */ ".----.",
		/* ! */ "-.-.--", /* / */ "-..-.", /* ( */ "-.--.", /* ) */ "-.--.-",
		/* & */ ".-...", /* : */ "---...", /* ; */ "-.-.-.", /* = */ "-...-",
		/* + */ ".-.-.", /* - */ "-....-", /* _ */ "..--.-", /* " */ ".-..-.",
		/* $ */ "...-..-", /* @ */ ".--.-.", /* ¿ */ "..-.-", /* ¡ */ "--...-"
	};

	vector <const char*> Morze_Numbers = {
		// Цифры idx: 0-9
		"-----", ".----", "..---", "...--", "....-",
		".....", "-....", "--...", "---..", "----."
	};

};

#endif // !SYMBOLS_H
